Documents/ВыкупСОтветственногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыкупСОтветственногоХранения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХраненияПереданные</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХранения</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизацийМТ</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыТОХпоДаннымПоставщиков</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ДокументыОснованияВыкупаТОХ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТОХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаВСмежнойБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставщикТОХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиТОХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ) </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснованияВыкупаТОХ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВедениеУчетаПоПроектам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиПартионныйУчетПоСкладам</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСкидкиПоВидуОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСкидкиПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСкидкиПоКоличествуТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСкидкиПоСуммеДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВключатьНДСВСтоимостьПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрABCКлассификацииПокупателей</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыABCКлассификацииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрРаспределенияПокупателейПоСтадиямВзаимоотношений</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыРаспределенияПокупателейПоСтадиямВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьПартииПриПроведенииДокументов</Name>
					<Comment>(Общ) Выполнять списание партий сразу же при проведении документов оперативного учета</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Comment>(Упр) Способ оценки МПЗ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтратегияСписанияПартийТоваровПоСтатусам</Name>
					<Comment>(Общ) Стратегия списания партий товаров по статусам партий</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтретегииСписанияПартийТоваровПоСтатусам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВключатьНДСВЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетТоваровОрганизацийВРазрезеСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНакопительныеСкидкиПоДисконтнымКартам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособИспользованияНакопительныхСкидок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыИспользованияНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаНакопленияСкидок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьНакопленияСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОпределениеВремениПроведенияПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияВремениПроведенияПлатежногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АнализироватьПрошлыйПериодНакопленияСкидок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыТОХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыТОХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоБраку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыкупСОтветственногоХранения/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мУказаниеСкладовВТЧ Экспорт; 
Перем мУдалятьДвижения;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок;
	
	ВестиУчетВРазрезеСкладов = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).ВестиУчетТоваровОрганизацийВРазрезеСкладов;
	
	Если НеСовпадаютДанныеСПоступлением() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если Не Отказ И Статус = Перечисления.СтатусыТОХ.Подтвержден Или Статус = Перечисления.СтатусыТОХ.Подготовлен
		И НЕ ЗначениеЗаполнено(Филиал) Тогда
		Отказ = НеСовпадаетКоличествоТовара();	
	КонецЕсли;  
	
	Если Не Отказ И Статус = Перечисления.СтатусыТОХ.Подтвержден Тогда
		ВыполнитьДвиженияДокументыОснованияВыкупаТОХ();
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(Филиал) И Не Статус = Перечисления.СтатусыТОХ.ВозвратПоБраку Тогда
		ВыполнитьДвиженияТоварыОрганизацийМТ();
	КонецЕсли;	
	
	ДатаСменыОП_ГП = Константы.ДатаСменыОП_ГП.Получить();
	
	Если ЗначениеЗаполнено(ДатаСменыОП_ГП) Тогда
		
		Если Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить() = Истина 
		   И Дата >= ДатаСменыОП_ГП
		   И Статус = Перечисления.СтатусыТОХ.Подготовлен Тогда
		   	ВыполнитьДвиженияПриходТоварыОрганизацийМТ();			
		ИначеЕсли Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить() = Ложь
		   И Дата < ДатаСменыОП_ГП 
		   И Статус = Перечисления.СтатусыТОХ.Подготовлен Тогда		
			ВыполнитьДвиженияПриходТоварыОрганизацийМТ();			
		КонецЕсли;
		
	Иначе
		
		Если Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить() = Истина
		   И Статус = Перечисления.СтатусыТОХ.Подготовлен Тогда
			ВыполнитьДвиженияПриходТоварыОрганизацийМТ();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыТОХ.ВозвратПоБраку Тогда 
		
		Если НЕ ЗначениеЗаполнено(Филиал) Тогда
			
			//Товары на складах
			НаборДвижений = Движения.ТоварыНаСкладах;
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
				
			КонецЦикла;	
			
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");			
			ТаблицаДвижений.ЗаполнитьЗначения(Склад, "Склад");			
			
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.ТоварыНаСкладах.ВыполнитьРасход();
			КонецЕсли; 
			
			//Товары в ячейках 
			ЯчейкаВозвратаПоступлений = Константы.ЯчейкаДляВозврата.Получить();
			
			Если ЯчейкаВозвратаПоступлений = Справочники.Ячейки.ПустаяСсылка()  Тогда 
				
				Сообщить("Не указана ячейка для возврата поступлений (см. константы системы)!");
				Отказ = Истина;
				Возврат;
				
			Иначе
				
				ТаблицаЯчеек = Новый ТаблицаЗначений;
				ТаблицаЯчеек.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
				ТаблицаЯчеек.Колонки.Добавить("Количество", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
				ТаблицаЯчеек.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
				ТаблицаЯчеек.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.Ячейки"));
				ТаблицаЯчеек.Колонки.Добавить("Период", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
				ТаблицаЯчеек.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
				
				Для Каждого СтрТаблицы ИЗ Товары Цикл  			
					
					НоваяСтрока = ТаблицаЯчеек.Добавить();	
					НоваяСтрока.Номенклатура = СтрТаблицы.Номенклатура;
					НоваяСтрока.Склад = Склад;															
					НоваяСтрока.Ячейка = ЯчейкаВозвратаПоступлений;
					НоваяСтрока.Период = Дата; 
					НоваяСтрока.Количество = СтрТаблицы.Количество;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					
				КонецЦикла;
				
				ТаблицаЯчеек.Свернуть("Номенклатура,Склад,Ячейка,Период,ВидДвижения","Количество");
				
			КонецЕсли;
			
			Если ТаблицаЯчеек.Количество() > 0 Тогда			
				
				НаборДвижений = Движения.ТоварыВЯчейках;
				// Подготовим структуру шапки документа
				СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
				// Проверим правильность заполнения шапки документа
				СтруктураОбязательныхПолей = Новый Структура();
				СтруктураОбязательныхПолей.Вставить("Организация");
				
				// Теперь вызовем общую процедуру проверки.
				ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
				
				НаборДвижений.КонтрольОстатков(ЭтотОбъект, ТаблицаЯчеек, СтруктураШапкиДокумента, Отказ, Заголовок);  		
				
				Если НЕ Отказ Тогда 				
					
					Для Каждого СтрокаТаблицы Из ТаблицаЯчеек Цикл
						
						Движение = Движения.ТоварыВЯчейках.Добавить();
						ЗаполнитьЗначенияСвойств(Движение,СтрокаТаблицы);
						
					КонецЦикла; 			
					
				КонецЕсли;    		
				
			КонецЕсли; 
			
			//Товары ответственного хранения 
			НаборДвижений = Движения.ТоварыОтветственногоХранения;
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
				
			КонецЦикла;	
			
			ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
			ТаблицаДвижений.ЗаполнитьЗначения(Контрагент, "Контрагент");
			ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
			
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.ТоварыОтветственногоХранения.ВыполнитьРасход();
			КонецЕсли;
			
			// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
			НаборДвижений = Движения.ТоварыОрганизаций;
			
			
			// Получим таблицу значений, совпадающую со структурой набора записей регистра.
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
			// Заполним таблицу движений.
			//ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
			Для Каждого СтрокаТовары Из Товары Цикл
				
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
				
			КонецЦикла;	
			
			// Недостающие поля.
			ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
			ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Комиссионер"); 
			ТаблицаДвижений.ЗаполнитьЗначения(?(ВестиУчетВРазрезеСкладов, Склад, Неопределено), "Склад");
			ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
			
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.ТоварыОрганизаций.ВыполнитьРасход();    	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Филиал) ИЛИ (ЗначениеЗаполнено(Филиал) И Статус = Перечисления.СтатусыТОХ.ВозвратПоБраку) Тогда  	
		ВыполнитьДвижениеПоРегиструТОХП(Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если ЗначениеЗаполнено(Филиал) Тогда
			
			НаборДвижений = Движения.ТоварыОтветственногоХранения;
			ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
				
			КонецЦикла;	
			
			ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
			ТаблицаДвижений.ЗаполнитьЗначения(Контрагент, "Контрагент");
			ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
			
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.ТоварыОтветственногоХранения.ВыполнитьРасход();
			КонецЕсли;
			
			
			ДвиженияПоРегиструТоварыОтветственногоХраненияПереданные(Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НеСовпадаютДанныеСПоступлением()

	Отказ = Ложь;                 
	ДокументНайден = Истина;
	
	ЗапросПоступления = Новый Запрос();
	ЗапросПоступления.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ДокументВыкупаСОтветственногоХранения = &Ссылка
	|	И ПоступлениеТоваровУслуг.Проведен";
	
	ЗапросПоступления.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапросПоступления = ЗапросПоступления.Выполнить().Выбрать();
	
	Если РезультатЗапросПоступления.Следующий() Тогда
		Поступление = РезультатЗапросПоступления.Ссылка;
	Иначе   
		
		Если Статус = Перечисления.СтатусыТОХ.Подтвержден Тогда
			Сообщить("Отсутствует документ Поступление!"); 
		КонецЕсли;
		
		ДокументНайден = Ложь;
		
	КонецЕсли;  
	
	Если Не ДокументНайден Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыкупСОтветственногоХраненияТовары.Номенклатура,
	|	СУММА(ВыкупСОтветственногоХраненияТовары.КоличествоМест) КАК КоличествоМест,
	|	ВыкупСОтветственногоХраненияТовары.ЕдиницаИзмерения,
	|	ВыкупСОтветственногоХраненияТовары.ЕдиницаИзмеренияМест,
	|	ВыкупСОтветственногоХраненияТовары.Коэффициент,
	|	СУММА(ВыкупСОтветственногоХраненияТовары.Количество) КАК Количество,
	|	МАКСИМУМ(ВыкупСОтветственногоХраненияТовары.Цена) КАК Цена,
	|	СУММА(ВыкупСОтветственногоХраненияТовары.Сумма) КАК Сумма,
	|	ВЫРАЗИТЬ(ВыкупСОтветственногоХраненияТовары.Номенклатура.Родитель.Наименование КАК СТРОКА(100)) КАК Производитель
	|ПОМЕСТИТЬ ВТ_Выкуп
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	|ГДЕ
	|	ВыкупСОтветственногоХраненияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыкупСОтветственногоХраненияТовары.Номенклатура,
	|	ВыкупСОтветственногоХраненияТовары.ЕдиницаИзмерения,
	|	ВыкупСОтветственногоХраненияТовары.ЕдиницаИзмеренияМест,
	|	ВыкупСОтветственногоХраненияТовары.Коэффициент,
	|	ВЫРАЗИТЬ(ВыкупСОтветственногоХраненияТовары.Номенклатура.Родитель.Наименование КАК СТРОКА(100))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.КоличествоМест) КАК КоличествоМест,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест,
	|	ПоступлениеТоваровУслугТовары.Коэффициент,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Цена) КАК Цена,
	|	СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК Сумма,
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.Номенклатура.Родитель.Наименование КАК СТРОКА(100)) КАК Производитель
	|ПОМЕСТИТЬ Вт_Поступление
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.ДокументВыкупаСОтветственногоХранения = &Ссылка
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест,
	|	ПоступлениеТоваровУслугТовары.Коэффициент,
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.Номенклатура.Родитель.Наименование КАК СТРОКА(100))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выкуп.Номенклатура КАК НоменклатураВыкуп,
	|	ВТ_Выкуп.КоличествоМест КАК КоличествоМестВыкуп,
	|	ВТ_Выкуп.ЕдиницаИзмерения КАК ЕдиницаИзмеренияВыкуп,
	|	ВТ_Выкуп.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМестВыкуп,
	|	ВТ_Выкуп.Коэффициент КАК КоэффициентВыкуп,
	|	ВТ_Выкуп.Количество КАК КоличествоВыкуп,
	|	ВТ_Выкуп.Цена КАК ЦенаВыкуп,
	|	ВТ_Выкуп.Сумма КАК СуммаВыкуп,
	|	Вт_Поступление.Номенклатура КАК НоменклатураПоступление,
	|	Вт_Поступление.КоличествоМест КАК КоличествоМестПоступление,
	|	Вт_Поступление.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоступление,
	|	Вт_Поступление.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМестПоступление,
	|	Вт_Поступление.Коэффициент КАК КоэффициентПоступление,
	|	Вт_Поступление.Количество КАК КоличествоПоступление,
	|	Вт_Поступление.Цена КАК ЦенаПоступление,
	|	Вт_Поступление.Сумма КАК СуммаПоступление,
	|	Вт_Поступление.Ссылка КАК Поступление,
	|	ВТ_Выкуп.Производитель КАК ПроизводительВыкуп,
	|	Вт_Поступление.Производитель КАК ПроизводительПоступление
	|ПОМЕСТИТЬ ВТ_Общая
	|ИЗ
	|	ВТ_Выкуп КАК ВТ_Выкуп
	|		ПОЛНОЕ СОЕДИНЕНИЕ Вт_Поступление КАК Вт_Поступление
	|		ПО ВТ_Выкуп.Номенклатура = Вт_Поступление.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Общая.НоменклатураВыкуп, """") КАК НоменклатураВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.КоличествоМестВыкуп, """") КАК КоличествоМестВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.ЕдиницаИзмеренияВыкуп, """") КАК ЕдиницаИзмеренияВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.ЕдиницаИзмеренияМестВыкуп, """") КАК ЕдиницаИзмеренияМестВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.КоэффициентВыкуп, """") КАК КоэффициентВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.КоличествоВыкуп, """") КАК КоличествоВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.СуммаВыкуп, """") КАК СуммаВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.НоменклатураПоступление, """") КАК НоменклатураПоступление,
	|	ЕСТЬNULL(ВТ_Общая.КоличествоМестПоступление, """") КАК КоличествоМестПоступление,
	|	ЕСТЬNULL(ВТ_Общая.ЕдиницаИзмеренияПоступление, """") КАК ЕдиницаИзмеренияПоступление,
	|	ЕСТЬNULL(ВТ_Общая.ЕдиницаИзмеренияМестПоступление, """") КАК ЕдиницаИзмеренияМестПоступление,
	|	ЕСТЬNULL(ВТ_Общая.КоэффициентПоступление, """") КАК КоэффициентПоступление,
	|	ЕСТЬNULL(ВТ_Общая.КоличествоПоступление, """") КАК КоличествоПоступление,
	|	ЕСТЬNULL(ВТ_Общая.СуммаПоступление, """") КАК СуммаПоступление,
	|	ЕСТЬNULL(ВТ_Общая.ПроизводительВыкуп, """") КАК ПроизводительВыкуп,
	|	ЕСТЬNULL(ВТ_Общая.ПроизводительПоступление, """") КАК ПроизводительПоступление
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_Общая КАК ВТ_Общая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.НоменклатураВыкуп,
	|	ВТ_Итог.КоличествоМестВыкуп,
	|	ВТ_Итог.ЕдиницаИзмеренияВыкуп,
	|	ВТ_Итог.ЕдиницаИзмеренияМестВыкуп,
	|	ВТ_Итог.КоэффициентВыкуп,
	|	ВТ_Итог.КоличествоВыкуп,
	|	ВТ_Итог.СуммаВыкуп,
	|	ВТ_Итог.НоменклатураПоступление,
	|	ВТ_Итог.КоличествоМестПоступление,
	|	ВТ_Итог.ЕдиницаИзмеренияПоступление,
	|	ВТ_Итог.ЕдиницаИзмеренияМестПоступление,
	|	ВТ_Итог.КоэффициентПоступление,
	|	ВТ_Итог.КоличествоПоступление,
	|	ВТ_Итог.СуммаПоступление,
	|	ВТ_Итог.ПроизводительВыкуп,
	|	ВТ_Итог.ПроизводительПоступление
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	(НЕ ВТ_Итог.НоменклатураВыкуп = ВТ_Итог.НоменклатураПоступление
	|			ИЛИ НЕ ВТ_Итог.КоличествоМестВыкуп = ВТ_Итог.КоличествоМестПоступление
	|			ИЛИ НЕ ВТ_Итог.КоличествоВыкуп = ВТ_Итог.КоличествоПоступление
	|			ИЛИ НЕ ВТ_Итог.ЕдиницаИзмеренияВыкуп = ВТ_Итог.ЕдиницаИзмеренияПоступление
	|			ИЛИ НЕ ВТ_Итог.ЕдиницаИзмеренияМестВыкуп = ВТ_Итог.ЕдиницаИзмеренияМестПоступление
	|			ИЛИ НЕ ВТ_Итог.КоэффициентВыкуп = ВТ_Итог.КоэффициентПоступление
	|			ИЛИ НЕ ВТ_Итог.СуммаВыкуп = ВТ_Итог.СуммаПоступление
	|			ИЛИ НЕ ВТ_Итог.ПроизводительВыкуп = ВТ_Итог.ПроизводительПоступление)";
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		
		Отказ = Истина;   
		
		ТабДок = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("Расхождения");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
		ОбластьШапка.Параметры.Выкуп       = Ссылка;
		ОбластьШапка.Параметры.Поступление = Поступление;
		
		ТабДок.Вывести(ОбластьШапка); 
		
	КонецЕсли;   
	
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.НоменклатураВыкуп        = Выборка.НоменклатураВыкуп;   
		
		Если ЗначениеЗаполнено(Выборка.НоменклатураВыкуп) Тогда
			ОбластьСтрока.Параметры.АртикулВыкуп             = Выборка.НоменклатураВыкуп.Артикул; 
		КонецЕсли;     
		
		ОбластьСтрока.Параметры.ПроизводительВыкуп       = Выборка.ПроизводительВыкуп;
		
		ОбластьСтрока.Параметры.НоменклатураПоступление  = Выборка.НоменклатураПоступление;
		
		Если ЗначениеЗаполнено(Выборка.НоменклатураПоступление) Тогда
			ОбластьСтрока.Параметры.АртикулПоступление       = Выборка.НоменклатураПоступление.Артикул;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.ПроизводительПоступление       = Выборка.ПроизводительПоступление; 
		
		Если НЕ ОбластьСтрока.Параметры.АртикулВыкуп = ОбластьСтрока.Параметры.АртикулПоступление тогда
			
			ОбластьСтрока.Область(1,2,1,2).ЦветФона = WebЦвета.СветлоРозовый; 
			ОбластьСтрока.Область(1,6,1,6).ЦветФона = WebЦвета.СветлоРозовый; 
			
		КонецЕсли;
		
		Если НЕ Выборка.ПроизводительВыкуп = Выборка.ПроизводительПоступление тогда 
			
			ОбластьСтрока.Область(1,3,1,3).ЦветФона = WebЦвета.СветлоРозовый; 
			ОбластьСтрока.Область(1,7,1,7).ЦветФона = WebЦвета.СветлоРозовый; 
			
		КонецЕсли;  
		
		ОбластьСтрока.Параметры.КолВыкуп                 = Выборка.КоличествоВыкуп; 
		ОбластьСтрока.Параметры.КолПоступление           = Выборка.КоличествоПоступление;
		
		Если НЕ Выборка.КоличествоВыкуп = Выборка.КоличествоПоступление тогда
			ОбластьСтрока.Область(1,7,1,8).ЦветФона = WebЦвета.СветлоРозовый;
		КонецЕсли;	
		
		ОбластьСтрока.Параметры.СуммаВыкуп               = Выборка.СуммаВыкуп; 
		ОбластьСтрока.Параметры.СуммаПоступление         = Выборка.СуммаПоступление; 
		
		Если НЕ Выборка.СуммаВыкуп = Выборка.СуммаПоступление тогда
			ОбластьСтрока.Область(1,9,1,10).ЦветФона = WebЦвета.СветлоРозовый;
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Если Отказ Тогда 
		
		Отказ = Истина;

		Если НЕ ТабДок = Неопределено Тогда
			ТабДок.Показать(); 
		КонецЕсли;  
		
	КонецЕсли;
	
	Возврат Отказ;

КонецФункции

Процедура ВыполнитьДвиженияДокументыОснованияВыкупаТОХ()

	НаборДвижений = Движения.ДокументыОснованияВыкупаТОХ;
	НаборДвижений.Очистить();
	
	тзТОХ = ДокументыОснованияВыкупаТОХ.Выгрузить();
	тзТОХ.Свернуть("ДокументОснование, Номенклатура, СерияНоменклатуры", "Количество");  
	
	Для Каждого Стр из тзТОХ Цикл
		
		НоваяЗапись = НаборДвижений.Добавить();
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.ДокументОснование = Стр.ДокументОснование;
		НоваяЗапись.Номенклатура = Стр.Номенклатура;
		НоваяЗапись.СерияНоменклатуры = Стр.СерияНоменклатуры;
		НоваяЗапись.Период =  Ссылка.Дата;
		НоваяЗапись.Количество =  Стр.Количество;
		
	КонецЦикла;
	
	Движения.ДокументыОснованияВыкупаТОХ.Записывать = Истина;
	
КонецПроцедуры   

Процедура ВыполнитьДвиженияТоварыОрганизацийМТ()
	
	НаборДвижений = Движения.ТоварыОрганизацийМТ;
	НаборДвижений.Очистить();
	
	Для Каждого Стр из Товары Цикл
		
		НоваяЗапись = НаборДвижений.Добавить(); 
		НоваяЗапись.ВидДвижения  = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период 		 = Дата;
		НоваяЗапись.Регистратор  = Ссылка;
		НоваяЗапись.Организация  = Организация;
		НоваяЗапись.Склад        = Склад;				
		НоваяЗапись.Номенклатура = Стр.Номенклатура;
		НоваяЗапись.Количество   = Стр.Количество; 
		
	КонецЦикла;

КонецПроцедуры

Функция НеСовпадаетКоличествоТовара()
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ВыкупСОтветственногоХраненияТовары.Номенклатура,
	|	СУММА(ВыкупСОтветственногоХраненияТовары.Количество) КАК Количество,
	|	ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	|ГДЕ
	|	ВыкупСОтветственногоХраненияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыкупСОтветственногоХраненияТовары.Номенклатура,
	|	ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Номенклатура,
	|	СУММА(ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Количество) КАК Количество,
	|	ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.СерияНоменклатуры
	|ПОМЕСТИТЬ ВТ_ПоОснованиям
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения.ДокументыОснованияВыкупаТОХ КАК ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ
	|ГДЕ
	|	ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Номенклатура,
	|	ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Товары.Номенклатура, ""ошибка"") КАК ТоварыНоменклатура,
	|	ЕСТЬNULL(ВТ_Товары.Количество, ""ошибка"") КАК ТоварыКоличество,
	|	ЕСТЬNULL(ВТ_Товары.СерияНоменклатуры, ""ошибка"") КАК ТоварыСерияНоменклатуры,
	|	ЕСТЬNULL(ВТ_ПоОснованиям.Номенклатура, ""ошибка"") КАК ОснованияНоменклатура,
	|	ЕСТЬNULL(ВТ_ПоОснованиям.Количество, ""ошибка"") КАК ОснованияКоличество,
	|	ЕСТЬNULL(ВТ_ПоОснованиям.СерияНоменклатуры, ""ошибка"") КАК ОснованияСерияНоменклатуры
	|ПОМЕСТИТЬ ВТ_Общая
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПоОснованиям КАК ВТ_ПоОснованиям
	|		ПО ВТ_Товары.Номенклатура = ВТ_ПоОснованиям.Номенклатура
	|			И ВТ_Товары.СерияНоменклатуры = ВТ_ПоОснованиям.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Общая.ТоварыНоменклатура,
	|	ВТ_Общая.ТоварыКоличество,
	|	ВТ_Общая.ТоварыСерияНоменклатуры,
	|	ВТ_Общая.ОснованияНоменклатура,
	|	ВТ_Общая.ОснованияКоличество,
	|	ВТ_Общая.ОснованияСерияНоменклатуры
	|ИЗ
	|	ВТ_Общая КАК ВТ_Общая
	|ГДЕ
	|	(НЕ ВТ_Общая.ТоварыНоменклатура = ВТ_Общая.ОснованияНоменклатура
	|			ИЛИ НЕ ВТ_Общая.ТоварыКоличество = ВТ_Общая.ОснованияКоличество
	|			ИЛИ НЕ ВТ_Общая.ТоварыСерияНоменклатуры = ВТ_Общая.ОснованияСерияНоменклатуры)"; 
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ПервыйРаз = Истина;
	
	Пока Результат.Следующий() Цикл  
		
		Если ПервыйРаз Тогда
			
			Сообщить("Не совпадает количество по следующим товарам:");	 
			ПервыйРаз = Ложь;
			
		КонецЕсли;  
		
		Артикул = "";
		
		Если Не Результат.ТоварыНоменклатура = "ошибка" Тогда
			Артикул = Результат.ТоварыНоменклатура.Артикул;
		ИначеЕсли Не Результат.ОснованияНоменклатура = "ошибка" Тогда 
			Артикул = Результат.ОснованияНоменклатура.Артикул;
		КонецЕсли;
		
		СерияНоменклатуры = "";
		
		Если Не Результат.ТоварыСерияНоменклатуры = "ошибка" Тогда
			СерияНоменклатуры = Результат.ТоварыСерияНоменклатуры;
		ИначеЕсли Не Результат.ОснованияСерияНоменклатуры = "ошибка" Тогда 
			СерияНоменклатуры = Результат.ОснованияСерияНоменклатуры;
		КонецЕсли;
		
		Сообщить("Артикул: "+Артикул + ", Серия: "+ СерияНоменклатуры);  
		
		Если НЕ РольДоступна("ТОХ_ПолныеПрава") Тогда
			Отказ = Истина; 
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Отказ;	

КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли; 
	
	//+Гавриленков В. 22.02.2025 #UT10-5105
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда     
		
		ДопускаютсяНезаполненныеРеквизиты = ДополнительныеСвойства.Свойство("НеПроверятьЗаполнениеРеквизитов");   
		
		Если Не ДопускаютсяНезаполненныеРеквизиты Тогда  
			
			СтруктураПроверяемыхРеквиизитов = Новый Структура;
			СтруктураПроверяемыхРеквиизитов.Вставить("Склад", "Склад");
			СтруктураПроверяемыхРеквиизитов.Вставить("Организация", "Организация");
			СтруктураПроверяемыхРеквиизитов.Вставить("Контрагент", "Контрагент");
			СтруктураПроверяемыхРеквиизитов.Вставить("ДоговорКонтрагента", "Договор контрагента");
			СтруктураПроверяемыхРеквиизитов.Вставить("Статус", "Статус");   
			
			ТекстОшибкиНеЗаполненРеквизит = "";
			Для Каждого Эл Из СтруктураПроверяемыхРеквиизитов Цикл
				
				Если Не ЗначениеЗаполнено(ЭтотОбъект[Эл.Ключ]) Тогда
					ТекстОшибкиНеЗаполненРеквизит = ТекстОшибкиНеЗаполненРеквизит + Эл.Значение + Символы.ПС;
				КонецЕсли;
				
			КонецЦикла;  
			
			Если ЗначениеЗаполнено(ТекстОшибкиНеЗаполненРеквизит) Тогда
				#Если Клиент Тогда 
					ТекстРеквизиты = ?(СтрЧислоСтрок(ТекстОшибкиНеЗаполненРеквизит) > 1, "заполнены реквизиты:" + Символы.ПС + "", "заполнен реквизит "); 
					Сообщить("Проведение документа прервано, т.к. не " + ТекстРеквизиты + ТекстОшибкиНеЗаполненРеквизит);	
				#КонецЕсли 
				Отказ = Истина;
			КонецЕсли;
					
		КонецЕсли;
		
	КонецЕсли;
	//-Гавриленков В. 22.02.2025 #UT10-5105
	
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(СвязанныеДокументы.Ссылка)
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
	               |ГДЕ
	               |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПоступлениеТоваровУслуг
	               |	И НЕ СвязанныеДокументы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапрос = Запрос.Выполнить();
	
	Если Не РезультатЗапрос.Пустой() Тогда
		
		Выборка = РезультатЗапрос.Выбрать();
		Выборка.Следующий();
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отмена проведения прервана по причине наличия ПТУ: " + Выборка.СсылкаПредставление;
		Сообщение.Сообщить();
	
	КонецЕсли;

	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("МХ3", "МХ-3 (Акт о возврате товарно-материальных ценностей)");
	Возврат СтруктураПечатныхФорм; 

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

#Если Клиент Тогда
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
	Если ЭтоНовый() Тогда
		
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
		
	КонецЕсли;
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "МХ3" Тогда
		ТабДокумент = ПечатьМХ3(ИмяМакета);
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
		
КонецПроцедуры // Печать
#КонецЕсли

Функция ПечатьМХ3(Тип) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза",          Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	Запрос.УстановитьПараметр("ТекущийДокумент",    ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыкупСОтветственногоХранения.Номер КАК Номер,
	|	ВыкупСОтветственногоХранения.Дата КАК ДатаСоставления,
	|	ВыкупСОтветственногоХранения.Дата КАК ДатаДокумента,
	|	ВыкупСОтветственногоХранения.Организация,
	|	ВыкупСОтветственногоХранения.Организация КАК ЮрФизЛицо,
	|	ВыкупСОтветственногоХранения.Организация КАК Руководители,
	|	ВыкупСОтветственногоХранения.Склад КАК Склад,
	|	ВыкупСОтветственногоХранения.Склад.Наименование КАК СкладНаименование,
	|	ВыкупСОтветственногоХранения.Контрагент.Код КАК КонтрагентКод,
	|	ВыкупСОтветственногоХранения.Контрагент КАК Контрагент,
	|	ВыкупСОтветственногоХранения.ВалютаДокумента,
	|	ВыкупСОтветственногоХранения.КурсВзаиморасчетов КАК Курс,
	|	ВыкупСОтветственногоХранения.КратностьВзаиморасчетов КАК Кратность,
	|	ОтветственныеЛица.ФизическоеЛицо КАК ОтветственноеЛицо,
	|	ВыкупСОтветственногоХранения.ДоговорКонтрагента КАК Основание,
	|	ВыкупСОтветственногоХранения.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	ВыкупСОтветственногоХранения.ДоговорКонтрагента.Номер КАК НомерДоговора
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения КАК ВыкупСОтветственногоХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ОтветственныеЛица
	|		ПО (ОтветственныеЛица.СтруктурнаяЕдиница = ВыкупСОтветственногоХранения.Склад)
	|ГДЕ
	|	ВыкупСОтветственногоХранения.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	
	Если ВалютаДокумента = ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		ЗапросПоТоварам.УстановитьПараметр("Курс",      ЭтотОбъект.КурсВзаиморасчетов);
		ЗапросПоТоварам.УстановитьПараметр("Кратность", ЭтотОбъект.КратностьВзаиморасчетов);
	Иначе
		ЗапросПоТоварам.УстановитьПараметр("Курс",      1);
		ЗапросПоТоварам.УстановитьПараметр("Кратность", 1);
	КонецЕсли;
	
	ЗапросПоТоварам.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура.Код КАК ТоварКод,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия,
	|	ВложенныйЗапрос.НоменклатураКод,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.Родитель.Наименование КАК СТРОКА(100)) КАК ТоварПроизвродитель
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыкупСОтветственногоХраненияТовары.Номенклатура КАК Номенклатура,
	|		ВыкупСОтветственногоХраненияТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		СУММА(ВыкупСОтветственногоХраненияТовары.Количество) КАК Количество,
	|		СУММА(ВыкупСОтветственногоХраненияТовары.Цена * &Курс / &Кратность) КАК Цена,
	|		СУММА(ВыкупСОтветственногоХраненияТовары.Сумма * &Курс / &Кратность) КАК Сумма,
	|		ВыкупСОтветственногоХраненияТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|		ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры КАК Серия,
	|		ВыкупСОтветственногоХраненияТовары.Номенклатура.КодПроизводителя КАК НоменклатураКод
	|	ИЗ
	|		Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	|	ГДЕ
	|		ВыкупСОтветственногоХраненияТовары.Ссылка = &ТекущийДокумент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВыкупСОтветственногоХраненияТовары.Номенклатура,
	|		ВыкупСОтветственногоХраненияТовары.ЕдиницаИзмерения,
	|		ВыкупСОтветственногоХраненияТовары.ХарактеристикаНоменклатуры,
	|		ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры,
	|		ВыкупСОтветственногоХраненияТовары.Номенклатура.КодПроизводителя) КАК ВложенныйЗапрос";
	
	ВыборкаСтрокТовары = ЗапросПоТоварам.Выполнить().Выбрать();
	
	Макет = ПолучитьМакет("МХ3");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыкупСОтветственногоХранения_МХ3";
	
	// Выводим общие реквизиты шапки
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ЮрФизЛицо, Шапка.ДатаСоставления);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоклажедержателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации,"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
	ОбластьМакета.Параметры.ПоклажедержательПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.НомерДокумента           	  = ОбщегоНазначения.ПолучитьНомерНаПечать(Шапка);
	ОбластьМакета.Параметры.НомерДоговора           	  = Шапка.НомерДоговора;
	ОбластьМакета.Параметры.ДатаДоговора           	      = Шапка.ДатаДоговора;
	
	Если Не ЗначениеЗаполнено(ПоставщикТОХ) Тогда
		ТекПоставщикТОХ = Справочники.ПоставщикиТОХ.НайтиПоРеквизиту("Контрагент", Контрагент);
	Иначе
		ТекПоставщикТОХ = ПоставщикТОХ; 
	КонецЕсли;
		
	Если ТекПоставщикТОХ.ПечатьМХ3наНачалоПериода Тогда
		ОбластьМакета.Параметры.ДатаДокумента = НачалоПериода;
	Иначе
		ОбластьМакета.Параметры.ДатаДокумента = Шапка.ДатаДокумента;
	КонецЕсли;	
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент,Макет,ОбластьМакета,Ссылка);	
	
	ПредставлениеПоклажедателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, 
	                                Шапка.ДатаСоставления),"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
	ОбластьМакета.Параметры.ПредставлениеПоклажедателя = ПредставлениеПоклажедателя;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница 1";
	ТабДокумент.Вывести(ЗаголовокТаблицы); 
	
	НомерСтраницы   = 1;
	КоличествоСтрок = ВыборкаСтрокТовары.Количество();
	
	// Инициализация итогов в документе
	ИтогоСумма				= 0;
	ИтогоСуммаНаСтранице    = 0;
	Ном              = 0;
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;
	
	// Выводим многострочную часть докмента
	ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
	ОбластьПодвала			= Макет.ПолучитьОбласть("Подвал");
	ОсобыеОтметкиПустые     = Макет.ПолучитьОбласть("ОсобыеОтметкиПустые"); 
	
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
			
		КонецЕсли;
		
		Ном = Ном + 1;
		
		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(ОбластьМакета); 
		МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
		
		Если Ном = КоличествоСтрок Тогда
			
			МассивВыводимыхОбластей.Добавить(ОбластьВсего);
			МассивВыводимыхОбластей.Добавить(ОсобыеОтметкиПустые);
			МассивВыводимыхОбластей.Добавить(ОбластьПодвала); 
			
		КонецЕсли;		
		
		Если НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			
			НомерСтраницы	= НомерСтраницы + 1; 
			ОбластьИтоговПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСуммаНаСтранице;
			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
			ИтогоСуммаНаСтранице = 0;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ЗаголовокТаблицы);
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		
		Сумма    = ВыборкаСтрокТовары.Сумма;
		
		Количество = ВыборкаСтрокТовары.Количество;
		Цена       = Сумма / Количество;
		
		ОбластьМакета.Параметры.Количество 		  = Количество;
		ОбластьМакета.Параметры.Сумма             = Сумма;
		ОбластьМакета.Параметры.Цена              = Цена;
		ОбластьМакета.Параметры.ПредставлениеНоменклатуры = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Примечание        = СокрЛП(ВыборкаСтрокТовары.ТоварПроизвродитель);
		ОбластьМакета.Параметры.НомерГТД  		  = СокрЛП(ВыборкаСтрокТовары.Серия.НомерГТД); 
		ТабДокумент.Вывести(ОбластьМакета);
		
		ИтогоСумма = ИтогоСумма + Сумма;
		ИтогоСуммаНаСтранице = ИтогоСуммаНаСтранице + Сумма;
		
	КонецЦикла;
	ОбластьИтоговПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСуммаНаСтранице; 
	ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
	
	ОбластьВсего.Параметры.ИтогоСумма = ИтогоСумма;	
	ТабДокумент.Вывести(ОбластьВсего);
	
	// Выводим особые отметки
	ТабДокумент.Вывести(ОсобыеОтметкиПустые);
	// Выводим Подвал
	ТабДокумент.Вывести(ОбластьПодвала);
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху         = 0;
	ТабДокумент.ПолеСлева          = 0;
	ТабДокумент.ПолеСнизу          = 0;
	ТабДокумент.ПолеСправа         = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;

КонецФункции 

Процедура ВыполнитьДвижениеПоРегиструТОХП(Отказ)
	
	НаборДвижений = Движения.ТоварыТОХпоДаннымПоставщиков;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыкупСОтветственногоХранения.Номенклатура КАК Номенклатура,
	|	СУММА(ВыкупСОтветственногоХранения.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХранения
	|ГДЕ
	|	ВыкупСОтветственногоХранения.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыкупСОтветственногоХранения.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ.Количество) КАК Количество,
	|	СУММА(ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	СУММА(ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) * ВТ.Количество
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Остатки(
	|				&МоментВремени,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура
	|					ИЗ
	|						ВТ КАК ВТ)) КАК ОстаткиНоменклатурыОстатки
	|		ПО ВТ.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) * ВТ.Количество
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Контрагент, "Контрагент");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "Договор");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыТОХпоДаннымПоставщиков.ВыполнитьРасход();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструТоварыОтветственногоХраненияПереданные(Отказ) 

	Если Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборДвижений = Движения.ТоварыОтветственногоХраненияПереданные;	
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 
	
	ЗапросДвиженийТоварыТОХПереданные = Новый Запрос;
	ЗапросДвиженийТоварыТОХПереданные.Текст =
	"ВЫБРАТЬ
	|	ВыкупСОтветственногоХраненияТовары.Ссылка.Организация,
	|	ВыкупСОтветственногоХраненияТовары.Ссылка.Контрагент,
	|	ВыкупСОтветственногоХраненияТовары.Номенклатура,
	|	ВыкупСОтветственногоХраненияТовары.Ссылка.ДоговорКонтрагента,
	|	ВыкупСОтветственногоХраненияТовары.Ссылка.Филиал,
	|	ВыкупСОтветственногоХраненияТовары.ХарактеристикаНоменклатуры,
	|	ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры,
	|	ВыкупСОтветственногоХраненияТовары.Количество
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	|ГДЕ
	|	ВыкупСОтветственногоХраненияТовары.Ссылка = &Ссылка";
	
	ЗапросДвиженийТоварыТОХПереданные.УстановитьПараметр("Ссылка",Ссылка);
	
	ПромТаблицаДвижений = ЗапросДвиженийТоварыТОХПереданные.Выполнить().Выгрузить();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ПромТаблицаДвижений, ТаблицаДвижений);
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;			
	
	Если Не Отказ Тогда
		Движения.ТоварыОтветственногоХраненияПереданные.ВыполнитьРасход();
	КонецЕсли;               

КонецПроцедуры

Процедура ВыполнитьДвиженияПриходТоварыОрганизацийМТ()

	НаборДвижений = Движения.ТоварыОрганизацийМТ;
	НаборДвижений.Очистить();
	
	Для Каждого Стр из Товары Цикл
		
		НоваяЗапись = НаборДвижений.Добавить(); 
		НоваяЗапись.ВидДвижения  = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период 		 = НачалоПериода;
		НоваяЗапись.Регистратор  = Ссылка;
		НоваяЗапись.Организация  = Организация;
		НоваяЗапись.Склад        = Склад;			
		НоваяЗапись.Номенклатура = Стр.Номенклатура;
		НоваяЗапись.Количество   = Стр.Количество; 
		
	КонецЦикла;
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
УказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");

мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления);
